<template>
	<view style="padding: 20rpx;font-size: 26rpx;">
		<view class="indent">我们尊重和保护用户的隐私。本隐私政策将告诉您我们如何收集和使用有关您的信息，以及我们如何保护这些信息的安全。</view>

		<view class="indent">您成为用户前务必仔细阅读本隐私条款并同意所有隐私条款。本隐私政策条款在您注册成为健康打卡吧用户后立即生效，并对您及众行信产生约束力。</view>

		<view  class="indent">一、我们可能收集的用户信息</view>

		<view class="indent">我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。</view>

		<view class="indent">1、您提供的信息</view>

		<view class="indent">•您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、身份证号码、住址等。</view>

		<view class="indent">•您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。</view>

		<view class="indent">2、其他方分享的您的信息</view>

		<view class="indent">•其他方使用我们的服务时所提供有关您的共享信息。</view>

		<view class="indent">3、我们获取的您的信息</view>

		<view class="indent">您使用服务时我们可能收集如下信息：</view>

		<view class="indent">•日志信息，指您使用我们的服务时，系统可能通过cookies或其他方式自动采集的技术信息，包括：设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；以及您在使用我们服务时要求提供的其他信息和内容详情。</view>

		<view class="indent">•位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息。您可以通过关闭定位功能，停止对您的地理位置信息的收集。</view>

		<view class="indent">•交易信息，指我们对您在众行信平台上形成的交易数据信息进行分析并形成用户信用数据库。</view>

		<view class="indent">二、我们可能如何使用用户信息</view>

		<view class="indent">•在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</view>

		<view class="indent">•帮助我们设计新服务，改善我们现有服务；</view>

		<view class="indent">•使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求；</view>

		<view class="indent">•让您参与有关我们产品和服务的调查。</view>

		<view class="indent">为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。</view>

		<view class="indent">三、我们可能与第三方共享的用户信息</view>

		<view class="indent">在下列情况下，我们可能会共享您的个人信息：</view>

		<view class="indent">•其他注册用户就您在众行信活动中的违约行为发起诉讼程序时，我们将应该等注册用户的请求向该等注册用户披露您的用户信息；</view>

		<view class="indent">•应行政、司法部门的要求向该等机构提供您的用户信息；</view>

		<view class="indent">•我们以及我们的关联公司，可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出短信或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的法域），为了我们向您提供或改善我们的服务；</view>

		<view class="indent">•随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移；</view>

		<view class="indent">•依据法律要求必须向第三方提供您的用户信息的情形；</view>

		<view class="indent">四、我们如何保护用户信息</view>

		<view class="indent">我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。</view>

		<view class="indent">五、隐私政策的修改</view>

		<view class="indent">由于法律法规的变更，以及为了与互联网的新发展和可能的发展趋势保持同步，我们可能会不定时修改本政策。因此，我们保留自行决定实施此类修改的权利，如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您推送通知或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。</view>
	</view>
</template>

<script>
	export default {

	}
</script>

<style lang="scss" scoped>
.indent{
	text-indent: 2em;
}
</style>
